layer {
  name: "my/input"
  type: "Input"
  top: "my/input"
  input_param {
    shape {
      dim: 6
      dim: 4
      dim: 64
      dim: 64
    }
  }
}
layer {
  name: "abs1"
  type: "AbsVal"
  bottom: "my/input"
  top: "abs1"
}
